Evaluations/adaptivePerf_TPDS_revision/data/output_2025_Oct_06_1216.txt
Running 20m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose
  8 threads and 100 connections

  Thread calibration: mean lat.: 92.192ms, rate sampling interval: 627ms
  Thread calibration: mean lat.: 56.235ms, rate sampling interval: 246ms
  Thread calibration: mean lat.: 100.851ms, rate sampling interval: 847ms
  Thread calibration: mean lat.: 58.981ms, rate sampling interval: 131ms
  Thread calibration: mean lat.: 112.323ms, rate sampling interval: 1033ms
  Thread calibration: mean lat.: 129.976ms, rate sampling interval: 1359ms
  Thread calibration: mean lat.: 86.259ms, rate sampling interval: 323ms
  Thread calibration: mean lat.: 166.544ms, rate sampling interval: 172ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   323.99ms  235.09ms   1.03s    65.13%
    Req/Sec     5.67      5.15    23.00     87.83%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  362.24ms
 75.000%  465.92ms
 90.000%  565.76ms
 99.000%    1.03s 
 99.900%    1.53s 
 99.990%    2.00s 
 99.999%    2.33s 
100.000%    2.44s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       8.967     0.000000            1         1.00
      11.767     0.100000         5701         1.11
      14.239     0.200000        11383         1.25
     265.215     0.300000        17246         1.43
     267.007     0.400000        23055         1.67
     362.239     0.500000        28810         2.00
     363.263     0.550000        31952         2.22
     364.031     0.600000        34175         2.50
     371.711     0.650000        36981         2.86
     464.895     0.700000        40039         3.33
     465.919     0.750000        42796         4.00
     466.431     0.775000        44444         4.44
     466.943     0.800000        45717         5.00
     467.711     0.825000        46968         5.71
     472.063     0.850000        48383         6.67
     509.183     0.875000        49776         8.00
     532.991     0.887500        50494         8.89
     565.759     0.900000        51207        10.00
     597.503     0.912500        51910        11.43
     631.807     0.925000        52631        13.33
     671.231     0.937500        53342        16.00
     692.735     0.943750        53690        17.78
     718.847     0.950000        54046        20.00
     752.639     0.956250        54398        22.86
     788.479     0.962500        54752        26.67
     828.927     0.968750        55111        32.00
     849.919     0.971875        55288        35.56
     869.887     0.975000        55464        40.00
     891.391     0.978125        55642        45.71
     911.871     0.981250        55822        53.33
     940.031     0.984375        55997        64.00
     964.095     0.985938        56086        71.11
     986.623     0.987500        56174        80.00
    1013.759     0.989062        56264        91.43
    1046.015     0.990625        56356       106.67
    1086.463     0.992188        56441       128.00
    1110.015     0.992969        56487       142.22
    1132.543     0.993750        56531       160.00
    1160.191     0.994531        56575       182.86
    1192.959     0.995313        56619       213.33
    1236.991     0.996094        56664       256.00
    1255.423     0.996484        56686       284.44
    1274.879     0.996875        56708       320.00
    1290.239     0.997266        56730       365.71
    1323.007     0.997656        56752       426.67
    1359.871     0.998047        56774       512.00
    1389.567     0.998242        56786       568.89
    1426.431     0.998437        56798       640.00
    1449.983     0.998633        56808       731.43
    1494.015     0.998828        56819       853.33
    1535.999     0.999023        56830      1024.00
    1552.383     0.999121        56836      1137.78
    1596.415     0.999219        56841      1280.00
    1631.231     0.999316        56847      1462.86
    1650.687     0.999414        56852      1706.67
    1710.079     0.999512        56858      2048.00
    1741.823     0.999561        56861      2275.56
    1766.399     0.999609        56863      2560.00
    1806.335     0.999658        56866      2925.71
    1875.967     0.999707        56869      3413.33
    1927.167     0.999756        56872      4096.00
    1942.527     0.999780        56873      4551.11
    1950.719     0.999805        56874      5120.00
    1951.743     0.999829        56876      5851.43
    1969.151     0.999854        56877      6826.67
    1998.847     0.999878        56879      8192.00
    1998.847     0.999890        56879      9102.22
    2067.455     0.999902        56880     10240.00
    2070.527     0.999915        56881     11702.86
    2070.527     0.999927        56881     13653.33
    2072.575     0.999939        56882     16384.00
    2072.575     0.999945        56882     18204.44
    2312.191     0.999951        56883     20480.00
    2312.191     0.999957        56883     23405.71
    2312.191     0.999963        56883     27306.67
    2334.719     0.999969        56884     32768.00
    2334.719     0.999973        56884     36408.89
    2334.719     0.999976        56884     40960.00
    2334.719     0.999979        56884     46811.43
    2334.719     0.999982        56884     54613.33
    2437.119     0.999985        56885     65536.00
    2437.119     1.000000        56885          inf
#[Mean    =      323.991, StdDeviation   =      235.093]
#[Max     =     2435.072, Total count    =        56885]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  57408 requests in 20.00m, 16.41MB read
  Socket errors: connect 0, read 0, write 0, timeout 21227
Requests/sec:     47.84  
Transfer/sec:     14.00KB
Running 20m test @ http://nginx-thrift.social-network3.svc.cluster.local:8080/wrk2-api/post/compose
  8 threads and 100 connections

  Thread calibration: mean lat.: 3159.401ms, rate sampling interval: 11018ms
  Thread calibration: mean lat.: 3757.011ms, rate sampling interval: 11255ms
  Thread calibration: mean lat.: 3533.393ms, rate sampling interval: 12951ms
  Thread calibration: mean lat.: 3301.153ms, rate sampling interval: 11173ms
  Thread calibration: mean lat.: 3891.387ms, rate sampling interval: 11862ms
  Thread calibration: mean lat.: 2818.252ms, rate sampling interval: 11509ms
  Thread calibration: mean lat.: 3813.667ms, rate sampling interval: 11747ms
  Thread calibration: mean lat.: 3594.877ms, rate sampling interval: 11796ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network3.svc.cluster.local:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   183.90ms  165.50ms 563.71ms   71.33%
    Req/Sec     5.48      0.82     7.00     98.77%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  188.93ms
 75.000%  219.65ms
 90.000%  314.62ms
 99.000%  563.71ms
 99.900%    1.84s 
 99.990%    5.17s 
 99.999%    7.21s 
100.000%    7.22s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       9.039     0.000000            1         1.00
      11.935     0.100000         5700         1.11
      14.511     0.200000        11396         1.25
     183.167     0.300000        17152         1.43
     187.391     0.400000        23036         1.67
     188.927     0.500000        28726         2.00
     189.951     0.550000        31347         2.22
     212.991     0.600000        34182         2.50
     217.855     0.650000        37282         2.86
     218.623     0.700000        39992         3.33
     219.647     0.750000        42933         4.00
     220.543     0.775000        44288         4.44
     223.615     0.800000        45576         5.00
     242.431     0.825000        47004         5.71
     271.615     0.850000        48426         6.67
     313.343     0.875000        49978         8.00
     314.111     0.887500        50697         8.89
     314.623     0.900000        51366        10.00
     315.391     0.912500        52192        11.43
     316.159     0.925000        52720        13.33
     321.535     0.937500        53416        16.00
     332.287     0.943750        53768        17.78
     344.831     0.950000        54121        20.00
     357.631     0.956250        54486        22.86
     370.687     0.962500        54834        26.67
     391.167     0.968750        55189        32.00
     401.919     0.971875        55371        35.56
     415.999     0.975000        55546        40.00
     430.335     0.978125        55724        45.71
     452.351     0.981250        55902        53.33
     482.815     0.984375        56080        64.00
     501.759     0.985938        56168        71.11
     523.775     0.987500        56257        80.00
     548.863     0.989062        56347        91.43
     580.607     0.990625        56435       106.67
     608.255     0.992188        56525       128.00
     626.175     0.992969        56571       142.22
     656.895     0.993750        56614       160.00
     705.023     0.994531        56658       182.86
     774.143     0.995313        56703       213.33
     866.303     0.996094        56747       256.00
     941.055     0.996484        56770       284.44
    1023.487     0.996875        56791       320.00
    1089.535     0.997266        56815       365.71
    1190.911     0.997656        56836       426.67
    1316.863     0.998047        56859       512.00
    1377.279     0.998242        56870       568.89
    1486.847     0.998437        56880       640.00
    1574.911     0.998633        56892       731.43
    1688.575     0.998828        56903       853.33
    1858.559     0.999023        56914      1024.00
    1961.983     0.999121        56919      1137.78
    2076.671     0.999219        56925      1280.00
    2174.975     0.999316        56931      1462.86
    2332.671     0.999414        56936      1706.67
    2592.767     0.999512        56942      2048.00
    2643.967     0.999561        56944      2275.56
    2752.511     0.999609        56947      2560.00
    2930.687     0.999658        56950      2925.71
    3434.495     0.999707        56953      3413.33
    3780.607     0.999756        56956      4096.00
    3850.239     0.999780        56957      4551.11
    4106.239     0.999805        56958      5120.00
    4521.983     0.999829        56960      5851.43
    4620.287     0.999854        56961      6826.67
    5165.055     0.999878        56963      8192.00
    5165.055     0.999890        56963      9102.22
    6574.079     0.999902        56964     10240.00
    6766.591     0.999915        56965     11702.86
    6766.591     0.999927        56965     13653.33
    6778.879     0.999939        56966     16384.00
    6778.879     0.999945        56966     18204.44
    7135.231     0.999951        56967     20480.00
    7135.231     0.999957        56967     23405.71
    7135.231     0.999963        56967     27306.67
    7208.959     0.999969        56968     32768.00
    7208.959     0.999973        56968     36408.89
    7208.959     0.999976        56968     40960.00
    7208.959     0.999979        56968     46811.43
    7208.959     0.999982        56968     54613.33
    7217.151     0.999985        56969     65536.00
    7217.151     1.000000        56969          inf
#[Mean    =      183.899, StdDeviation   =      165.503]
#[Max     =     7213.056, Total count    =        56969]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  57417 requests in 20.00m, 16.47MB read
  Socket errors: connect 0, read 0, write 0, timeout 21206
  Non-2xx or 3xx responses: 28
Requests/sec:     47.84  
Transfer/sec:     14.05KB
Running 20m test @ http://nginx-thrift.social-network2.svc.cluster.local:8080/wrk2-api/post/compose
  8 threads and 100 connections

  Thread calibration: mean lat.: 248.082ms, rate sampling interval: 521ms
  Thread calibration: mean lat.: 79.698ms, rate sampling interval: 497ms
  Thread calibration: mean lat.: 210.197ms, rate sampling interval: 48ms
  Thread calibration: mean lat.: 238.448ms, rate sampling interval: 1483ms
  Thread calibration: mean lat.: 173.191ms, rate sampling interval: 565ms
  Thread calibration: mean lat.: 251.576ms, rate sampling interval: 1738ms
  Thread calibration: mean lat.: 50.626ms, rate sampling interval: 30ms
  Thread calibration: mean lat.: 613.141ms, rate sampling interval: 2871ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network2.svc.cluster.local:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    88.95ms   50.59ms 214.40ms   70.56%
    Req/Sec     5.95     12.25    42.00     82.37%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  117.89ms
 75.000%  126.53ms
 90.000%  129.02ms
 99.000%  214.40ms
 99.900%  271.36ms
 99.990%  354.56ms
 99.999%  390.91ms
100.000%  400.64ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       8.399     0.000000            1         1.00
      11.399     0.100000         5710         1.11
      13.439     0.200000        11395         1.25
      79.999     0.300000        17076         1.43
      81.215     0.400000        22847         1.67
     117.887     0.500000        28494         2.00
     118.975     0.550000        31325         2.22
     119.679     0.600000        34186         2.50
     120.447     0.650000        36990         2.86
     122.047     0.700000        39871         3.33
     126.527     0.750000        42729         4.00
     126.975     0.775000        44188         4.44
     127.359     0.800000        45711         5.00
     127.679     0.825000        46961         5.71
     128.063     0.850000        48453         6.67
     128.511     0.875000        49923         8.00
     128.767     0.887500        50617         8.89
     129.023     0.900000        51221        10.00
     129.407     0.912500        51934        11.43
     129.983     0.925000        52689        13.33
     131.007     0.937500        53378        16.00
     132.095     0.943750        53705        17.78
     135.935     0.950000        54055        20.00
     144.511     0.956250        54416        22.86
     154.623     0.962500        54766        26.67
     163.967     0.968750        55121        32.00
     170.239     0.971875        55300        35.56
     176.255     0.975000        55478        40.00
     182.143     0.978125        55656        45.71
     186.367     0.981250        55835        53.33
     195.455     0.984375        56011        64.00
     200.191     0.985938        56103        71.11
     204.799     0.987500        56189        80.00
     211.071     0.989062        56277        91.43
     216.959     0.990625        56366       106.67
     223.487     0.992188        56455       128.00
     226.815     0.992969        56499       142.22
     229.503     0.993750        56544       160.00
     232.063     0.994531        56589       182.86
     234.879     0.995313        56633       213.33
     238.079     0.996094        56677       256.00
     241.023     0.996484        56700       284.44
     244.095     0.996875        56722       320.00
     246.911     0.997266        56744       365.71
     249.727     0.997656        56766       426.67
     252.031     0.998047        56788       512.00
     254.207     0.998242        56800       568.89
     256.383     0.998437        56811       640.00
     260.863     0.998633        56822       731.43
     266.751     0.998828        56833       853.33
     272.639     0.999023        56844      1024.00
     275.711     0.999121        56849      1137.78
     278.783     0.999219        56855      1280.00
     282.623     0.999316        56861      1462.86
     289.535     0.999414        56867      1706.67
     293.119     0.999512        56872      2048.00
     296.959     0.999561        56874      2275.56
     302.079     0.999609        56877      2560.00
     307.967     0.999658        56880      2925.71
     311.295     0.999707        56883      3413.33
     323.839     0.999756        56886      4096.00
     325.631     0.999780        56887      4551.11
     328.447     0.999805        56888      5120.00
     340.223     0.999829        56890      5851.43
     344.063     0.999854        56891      6826.67
     354.559     0.999878        56893      8192.00
     354.559     0.999890        56893      9102.22
     356.095     0.999902        56894     10240.00
     357.887     0.999915        56895     11702.86
     357.887     0.999927        56895     13653.33
     361.215     0.999939        56896     16384.00
     361.215     0.999945        56896     18204.44
     368.639     0.999951        56897     20480.00
     368.639     0.999957        56897     23405.71
     368.639     0.999963        56897     27306.67
     390.911     0.999969        56898     32768.00
     390.911     0.999973        56898     36408.89
     390.911     0.999976        56898     40960.00
     390.911     0.999979        56898     46811.43
     390.911     0.999982        56898     54613.33
     400.639     0.999985        56899     65536.00
     400.639     1.000000        56899          inf
#[Mean    =       88.952, StdDeviation   =       50.594]
#[Max     =      400.384, Total count    =        56899]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  57422 requests in 20.00m, 16.45MB read
  Socket errors: connect 0, read 0, write 0, timeout 21239
Requests/sec:     47.85  
Transfer/sec:     14.04KB